### Based on titanic dataset, the below classifier is to predict if a customer survived or not

In [1]:
import pandas as pd

In [2]:
#Importing Data

df = pd.read_csv(r"C:\Users\USER\Desktop\DATA\ML\titanic.csv")
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [3]:
#Selecting required columns

df = df[['Pclass','Sex','Age','Fare','Survived']]

df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [4]:
target = df.Survived
inputs = df.drop(columns='Survived')

In [5]:
#Creating numerical representation of gender

dummies = pd.get_dummies(inputs.Sex)
dummies.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
#Adding the gender values columns to the inputs dataframe

inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
#Dropping the sex column
inputs.drop(columns='Sex',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
#Checking for NAN values

inputs.columns[inputs.isna().any()] #The age column has nan values

Index(['Age'], dtype='object')

In [9]:
inputs['Age'].isna().sum() #checking for the number of nan values in the column

177

In [10]:
inputs.Age = inputs['Age'].fillna(inputs.Age.mean())

In [11]:
inputs['Age'].isna().sum() #the nan values have been filled

0

In [12]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [13]:
len(inputs)

891

In [14]:
len(X_train)

712

In [15]:
len(X_test)

179

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB()

In [18]:
model.score(X_test,y_test)

0.8435754189944135

In [19]:
#checking test values

X_test[:10]

     Pclass        Age      Fare  female  male
623       3  21.000000    7.8542       0     1
748       1  19.000000   53.1000       0     1
284       1  29.699118   26.0000       0     1
185       1  29.699118   50.0000       0     1
246       3  25.000000    7.7750       1     0
337       1  41.000000  134.5000       1     0
215       1  31.000000  113.2750       1     0
306       1  29.699118  110.8833       1     0
2         3  26.000000    7.9250       1     0
352       3  15.000000    7.2292       0     1

In [20]:
y_test[:10]

623    0
748    0
284    0
185    0
246    0
337    1
215    1
306    1
2      1
352    0
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 1, 1, 1, 1, 1, 0], dtype=int64)

In [23]:
model.predict(X_test[:15])

array([0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1], dtype=int64)